

using CSharpLinq;

var homework = new Homework();



/**********************************************************************************/





#region
/*1. Обьявить коллекцию из 10и любых чисел. Выбрать из них те, что
делятся на 3. Вывести результирующую коллекцию на консоль.
Использовать синтаксис запросов.*/
homework.Task1();




#endregion


#region

/* 2. Объявить коллекцию из 10и любых чисел от 7 до 15. Половину из них
объявить отрицательными. Выбрать из них те, которые отрицательные
и меньше 10и. Использовать синтаксис расширений. */


homework.Task2();

#endregion



#region

/*3. Объявить коллекцию из 5и наименований. Это могут быть
имена/животные/книги. Выбрать из них те, которые имеют в себе
четное количество символов и отсортируйте коллекцию в алфавитном
порядке. Использовать синтаксис запросов.*/

homework.Task3();


#endregion

#region


/*4. Объявите коллекцию из 6и городов. Выберите из них те, которые
начинаются и заканчиваются на определенные буквы. Букву начала и
конца выберите самостоятельно. Использовать синтаксис расширений.*/

homework.Task4();

#endregion

#region
/*5. Введите из консоли строку, которая содержит в себе слова, написанные
прописными и строчными буквами. Разбейте строку на отдельные слова и занесите их в коллекцию.
Из данной коллекции выберите слова, которые написаны прописными буквами. Используйте любой
синтаксис.*/

homework.Task5();






#endregion

#region
/*6. Объявите коллекцию из 10и чисел. 4 из них должны быть
повторяющими другие существующие числа. С помощью linq удалите
все дубликаты из коллекции и введите итог на консоль в обратном
порядке. Используйте любой синтаксис.*/


homework.Task6();




#endregion

#region

/*7. Объявите коллекцию из 10 чисел. Позвольте пользователю ввести
любое число из консоли. Определите входит ли введенное число в
коллекцию с помощью linq и выведите ответ пользователю в
зависимости от наличия введенного числа в имеющейся коллекции.
Используйте любой синтаксис*/

homework.Task7();

#endregion

#region
/* 8. Объявите коллекцию из не менее 3х любых строк. Посчитайте с
помощью linq сумму длин всех элементов коллекции. Если сумма
больше 5и символов, то выведите на консоль первый и последний
элементы. Используйте любой синтаксис.*/

homework.Task8();

#endregion




#region

/*9.Внимательно посмотрите на классы объектов, созданных в заданиях на
ооп. Выберите из них любой, например, выдру из домашки по 7му
уроку. Выберите 1 свойство у объекта, например, цвет выдры. Создайте
коллекцию из 3х значений этих полей, например bald, brown, yellow. С
помощью оператора select и коллекции свойств создайте коллекцию из
3х экземпляров класса. Используйте любой синтаксис*/

homework.Task9();

#endregion

#region

/* 10.Объявите коллекцию из 3х экземпляров класса, выбранного в 9м
задании. Создайте новую коллекцию, которая будет содержать только
значения свойств, выбранных в задании 9. Используйте оператор select.
Используйте любой синтаксис.*/

homework.Task10();

#endregion* 
